paper3/campaign-1-platform-actuation/results-run2/calibration/cachepart-fio-write-end.txt
cachewrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
cachewrite: Laying out IO file (1 file / 2048MiB)

cachewrite: (groupid=0, jobs=1): err= 0: pid=52921: Wed Sep  9 07:51:29 2026
  write: IOPS=1116, BW=1116MiB/s (1170MB/s)(32.7GiB/30001msec); 0 zone resets
    clat (usec): min=268, max=4631, avg=874.93, stdev=167.97
     lat (usec): min=277, max=4647, avg=895.26, stdev=168.86
    clat percentiles (usec):
     |  1.00th=[  310],  5.00th=[  379], 10.00th=[  881], 20.00th=[  906],
     | 30.00th=[  914], 40.00th=[  914], 50.00th=[  922], 60.00th=[  922],
     | 70.00th=[  930], 80.00th=[  930], 90.00th=[  938], 95.00th=[  938],
     | 99.00th=[  955], 99.50th=[  971], 99.90th=[ 2024], 99.95th=[ 2278],
     | 99.99th=[ 3032]
   bw (  MiB/s): min= 1060, max= 2352, per=100.00%, avg=1117.53, stdev=246.08, samples=59
   iops        : min= 1060, max= 2352, avg=1117.53, stdev=246.08, samples=59
  lat (usec)   : 500=8.54%, 750=0.39%, 1000=90.75%
  lat (msec)   : 2=0.21%, 4=0.11%, 10=0.01%
  cpu          : usr=2.65%, sys=3.18%, ctx=33488, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,33487,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1116MiB/s (1170MB/s), 1116MiB/s-1116MiB/s (1170MB/s-1170MB/s), io=32.7GiB (35.1GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/267298, sectors=0/68353544, merge=0/50, ticks=0/124140, in_queue=124139, util=94.25%