paper3/campaign-1-platform-actuation/results-run2/calibration/cachepart-fio-write-start.txt
cachewrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
cachewrite: Laying out IO file (1 file / 2048MiB)

cachewrite: (groupid=0, jobs=1): err= 0: pid=12271: Wed Sep  9 05:58:39 2026
  write: IOPS=1036, BW=1036MiB/s (1087MB/s)(30.4GiB/30001msec); 0 zone resets
    clat (usec): min=261, max=4475, avg=933.13, stdev=391.39
     lat (usec): min=269, max=4498, avg=964.01, stdev=392.17
    clat percentiles (usec):
     |  1.00th=[  302],  5.00th=[  355], 10.00th=[  873], 20.00th=[  889],
     | 30.00th=[  898], 40.00th=[  906], 50.00th=[  906], 60.00th=[  914],
     | 70.00th=[  922], 80.00th=[  930], 90.00th=[  938], 95.00th=[  947],
     | 99.00th=[ 2802], 99.50th=[ 2802], 99.90th=[ 2835], 99.95th=[ 2835],
     | 99.99th=[ 3097]
   bw (  MiB/s): min=  980, max= 2406, per=100.00%, avg=1037.69, stdev=248.80, samples=59
   iops        : min=  980, max= 2406, avg=1037.69, stdev=248.80, samples=59
  lat (usec)   : 500=8.21%, 750=0.14%, 1000=87.49%
  lat (msec)   : 2=0.51%, 4=3.64%, 10=0.01%
  cpu          : usr=3.72%, sys=3.00%, ctx=31096, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,31095,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1036MiB/s (1087MB/s), 1036MiB/s-1036MiB/s (1087MB/s-1087MB/s), io=30.4GiB (32.6GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/266659, sectors=0/68207000, merge=0/124, ticks=0/155242, in_queue=155242, util=91.06%