paper3/campaign-1-platform-actuation/results-run2/calibration/node-fio-read-end.txt
seqread: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqread: Laying out IO file (1 file / 2048MiB)

seqread: (groupid=0, jobs=1): err= 0: pid=52776: Wed Sep  9 07:50:59 2026
  read: IOPS=1401, BW=1402MiB/s (1470MB/s)(41.1GiB/30001msec)
    clat (usec): min=511, max=2776, avg=712.98, stdev=65.79
     lat (usec): min=512, max=2776, avg=713.03, stdev=65.79
    clat percentiles (usec):
     |  1.00th=[  553],  5.00th=[  578], 10.00th=[  594], 20.00th=[  685],
     | 30.00th=[  701], 40.00th=[  725], 50.00th=[  734], 60.00th=[  742],
     | 70.00th=[  750], 80.00th=[  758], 90.00th=[  766], 95.00th=[  783],
     | 99.00th=[  824], 99.50th=[  832], 99.90th=[  906], 99.95th=[ 1106],
     | 99.99th=[ 1467]
   bw (  MiB/s): min= 1356, max= 1704, per=100.00%, avg=1402.85, stdev=117.31, samples=59
   iops        : min= 1356, max= 1704, avg=1402.85, stdev=117.31, samples=59
  lat (usec)   : 750=70.58%, 1000=29.35%
  lat (msec)   : 2=0.07%, 4=0.01%
  cpu          : usr=0.12%, sys=4.66%, ctx=42048, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=42048,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1402MiB/s (1470MB/s), 1402MiB/s-1402MiB/s (1470MB/s-1470MB/s), io=41.1GiB (44.1GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=334462/337, sectors=85622272/3968, merge=0/151, ticks=152865/26, in_queue=152891, util=95.08%