paper3/campaign-1-platform-actuation/results-run2/calibration/node-fio-read-start.txt
seqread: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqread: Laying out IO file (1 file / 2048MiB)

seqread: (groupid=0, jobs=1): err= 0: pid=12180: Wed Sep  9 05:58:08 2026
  read: IOPS=1409, BW=1410MiB/s (1478MB/s)(41.3GiB/30001msec)
    clat (usec): min=499, max=5664, avg=708.85, stdev=101.70
     lat (usec): min=499, max=5664, avg=708.91, stdev=101.70
    clat percentiles (usec):
     |  1.00th=[  545],  5.00th=[  562], 10.00th=[  586], 20.00th=[  611],
     | 30.00th=[  685], 40.00th=[  701], 50.00th=[  717], 60.00th=[  734],
     | 70.00th=[  750], 80.00th=[  758], 90.00th=[  766], 95.00th=[  816],
     | 99.00th=[ 1123], 99.50th=[ 1205], 99.90th=[ 1369], 99.95th=[ 1418],
     | 99.99th=[ 1762]
   bw (  MiB/s): min= 1356, max= 1676, per=100.00%, avg=1410.98, stdev=116.99, samples=59
   iops        : min= 1356, max= 1676, avg=1410.98, stdev=116.99, samples=59
  lat (usec)   : 500=0.01%, 750=72.36%, 1000=25.59%
  lat (msec)   : 2=2.04%, 4=0.01%, 10=0.01%
  cpu          : usr=0.15%, sys=4.96%, ctx=42289, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=42288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1410MiB/s (1478MB/s), 1410MiB/s-1410MiB/s (1478MB/s-1478MB/s), io=41.3GiB (44.3GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=337741/20214, sectors=86461696/5119328, merge=0/124, ticks=155655/7205, in_queue=162859, util=92.15%