paper3/campaign-1-platform-actuation/results-run2/calibration/node-fio-write-end.txt
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqwrite: Laying out IO file (1 file / 2048MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=52639: Wed Sep  9 07:50:27 2026
  write: IOPS=1095, BW=1096MiB/s (1149MB/s)(32.1GiB/30001msec); 0 zone resets
    clat (usec): min=258, max=6496, avg=894.65, stdev=177.22
     lat (usec): min=271, max=6512, avg=912.09, stdev=177.76
    clat percentiles (usec):
     |  1.00th=[  310],  5.00th=[  420], 10.00th=[  898], 20.00th=[  914],
     | 30.00th=[  914], 40.00th=[  922], 50.00th=[  922], 60.00th=[  930],
     | 70.00th=[  930], 80.00th=[  930], 90.00th=[  938], 95.00th=[  947],
     | 99.00th=[  955], 99.50th=[  971], 99.90th=[ 2245], 99.95th=[ 4686],
     | 99.99th=[ 5866]
   bw (  MiB/s): min=  952, max= 2264, per=100.00%, avg=1096.58, stdev=203.60, samples=59
   iops        : min=  952, max= 2264, avg=1096.58, stdev=203.60, samples=59
  lat (usec)   : 500=5.79%, 750=0.29%, 1000=93.59%
  lat (msec)   : 2=0.20%, 4=0.08%, 10=0.05%
  cpu          : usr=2.32%, sys=3.04%, ctx=32872, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32869,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1096MiB/s (1149MB/s), 1096MiB/s-1096MiB/s (1149MB/s-1149MB/s), io=32.1GiB (34.5GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/263090, sectors=0/67250432, merge=0/1849, ticks=0/129307, in_queue=129307, util=94.60%