paper3/campaign-1-platform-actuation/results-run2/calibration/node-fio-write-start.txt
seqwrite: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process
seqwrite: Laying out IO file (1 file / 2048MiB)

seqwrite: (groupid=0, jobs=1): err= 0: pid=12038: Wed Sep  9 05:57:36 2026
  write: IOPS=1030, BW=1030MiB/s (1080MB/s)(30.2GiB/30001msec); 0 zone resets
    clat (usec): min=259, max=7675, avg=938.15, stdev=417.04
     lat (usec): min=270, max=7727, avg=970.11, stdev=417.73
    clat percentiles (usec):
     |  1.00th=[  297],  5.00th=[  355], 10.00th=[  873], 20.00th=[  889],
     | 30.00th=[  898], 40.00th=[  906], 50.00th=[  906], 60.00th=[  914],
     | 70.00th=[  922], 80.00th=[  930], 90.00th=[  938], 95.00th=[  955],
     | 99.00th=[ 2802], 99.50th=[ 2802], 99.90th=[ 2868], 99.95th=[ 5473],
     | 99.99th=[ 6587]
   bw (  MiB/s): min=  844, max= 2344, per=100.00%, avg=1031.22, stdev=243.04, samples=59
   iops        : min=  844, max= 2344, avg=1031.22, stdev=243.04, samples=59
  lat (usec)   : 500=7.91%, 750=0.18%, 1000=87.65%
  lat (msec)   : 2=0.51%, 4=3.66%, 10=0.09%
  cpu          : usr=3.81%, sys=2.93%, ctx=30910, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,30902,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1030MiB/s (1080MB/s), 1030MiB/s-1030MiB/s (1080MB/s-1080MB/s), io=30.2GiB (32.4GB), run=30001-30001msec

Disk stats (read/write):
  nvme1n1: ios=0/266132, sectors=0/68062720, merge=0/179, ticks=0/161807, in_queue=161807, util=91.03%